<?php
	//Default Configuration
	$CONFIG = '{"lang":"zh-CN","error_reporting":false,"show_hidden":false,"hide_Cols":false,"theme":"dark"}';
	
	$tcp_port = "";

	// 特殊账号
	// uid 4523 游客
	// uid 4524 匿名

	// 背景壁纸二级域名
	// $bg_port = "https://bg.galbase.top";
	// $bg_port = "http://127.0.0.1:8000/data/bgs";

	// 禁止域名访问
	// if ($_SERVER['HTTP_HOST'] == 'xxxx.top' && !strstr($_SERVER['REQUEST_URI'], "GetOneDriveDirectLink")) {		
	// 	echo "<script>alert('当前论坛禁止使用域名访问，正在为您自动跳转至IPV4')</script>";
	// 	header("Location: http://38.47.99.242:8080" . $_SERVER['REQUEST_URI']);
	// }

	// 背景壁纸
	$bgs = array(
		1 => "1|23",	// 野良猫1
		2 => "1|43",	// 水平线尽头有多远
		3 => "1|36",	// 飞机云
		4 => "1|75",	// 苍彼
		5 => "1|60",	// 碧海晴空
		6 => "1|158",	// 恋选巧克力
		7 => "1|22",	// 青空下的约定
		8 => "1|12",	// 望见青空之丘
		9 => "1|83",	// 我们为了恋爱而诞生
		10 => "1|297",	// 看星星
		11 => "1|99",	// 青夏轨迹
		12 => "2|316",	// clannad
		13 => "2|139",	// 夏日最后一天
		14 => "2|121",	// 八卦之恋
		15 => "2|61",	// 赤色约定
		16 => "2|190",	// 初恋一比一
		17 => "2|87",	// 初雪樱
		18 => "2|39",	// 初音岛1
		19 => "3|454",	// 创彼女
		20 => "3|33",	// 纯白交响曲
		21 => "3|92",	// 纯白交响曲 SANA
		22 => "3|33",	// 纯真之夏
		23 => "3|211",	// 富婆妹
		24 => "3|45",	// 富婆妹 FD
		25 => "3|99",	// 寄宿之恋
		26 => "4|139",	// 借恋
		27 => "4|91",	// 恋爱成双
		28 => "4|35",	// 石头门
		29 => "4|222",	// 魔女的夜宴
		30 => "4|29",	// 造火箭
		31 => "4|62",	// 秋回1
		32 => "4|24",	// 秋回2
		33 => "4|13",	// 秋回3
		34 => "4|23",	// 秋回6
		35 => "4|103",	// 秋回7
		36 => "4|139",	// 秋回8
		37 => "4|64",	// 金恋
		38 => "5|283",	// 恋彼女
		39 => "5|72",	// 向日葵的教会与长夏假期
		40 => "5|45",	// 心之彼端2
		41 => "5|388",	// 星织梦
		42 => "5|110",  // 看星星IF
		43 => "5|60",	// 遥仰凰华
		44 => "6|169",	// 银色遥远
		45 => "6|27",	// 与她心渐近
		46 => "6|64",	// 在月之彼岸邂逅
		47 => "6|114",  // 大展翅
		48 => "6|10"	// 纸魔
	);

	// 定义版块名字
	$boards = array(
		'1-1' => '「资源收入繁华街」',
		'1-2' => '「资源合集 / TOP作品推荐」',
		'1-3' => '「玩后感 / 杂谈 / 忘却的旋律」',
		'1-4' => '「幌路北学园演剧社」',
		'2-1' => '「澄空心情驿站 / 心跳町温泉」',
		'2-2' => '「凰华学院图书馆」',
		'2-3' => '「Cubic Cafe / YuKuRu咖啡厅」',
		'2-4' => '「汐凪第一学园演唱会」',
		'3-1' => '「外部社区数据」',
		'3-2' => '「夏色苏打水同好会」'
	);

	$permissions = array(
		'结姬学园一年生' => 1,
		'结姬学园二年生' => 2,
		'结姬学园三年生' => 3,
		'结姬学园高校一年生' => 4,
		'结姬学园高校二年生' => 5,
		'结姬学园高校三年生' => 6,
		'结姬学园风纪委员' => 6,
		'结姬学园学生会副会长' => 9,
		'结姬学园学生会会长' => 10,
		'结姬学园在校毕业生' => 98,
		'结姬学园校长' => 99
	);

	// 系统配置
	$config = array(
		// R2对应的域名
		'data1' => "https://data1.galbase.top",
		'data2' => "https://d2gal.dpdns.org",
		'data3' => "https://d3gal.dpdns.org",

		// 维护开关
		'maintenance' => FALSE,
		'maintenance_msg' => "",

		// 维护是否禁止访问
		'disable_visit' => FALSE,

		// 一天下载次数限制
		'download_count' => 9999,

		// 帖子储存服务器总数
		'data_server_count' => 2,

		// 动画储存服务器总数
		'anime_server_count' => 1,

		// 所有随机头像数量
		'random_avatars' => 22,

		// 新年灯笼
		'new_yeah_lantern' => FALSE,

		// 下雪
		'snow' => TRUE,

		'none' => 'none'
	);

	// 本地化
	if ($_SERVER['SERVER_ADDR'] == "127.0.0.1") {
		$config['data1'] = "http://127.0.0.1:8000/data/forums/3/data3";
		$config['data2'] = "http://127.0.0.1:8000/data/forums/3/data3";
		$config['data3'] = "http://127.0.0.1:8000/data/forums/3/data3";
	}